---
type: ZoneElementDomainData
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 2
tags: [revit-api, class]
---

# ZoneElementDomainData

`Autodesk.Revit.DB.Mechanical.ZoneElementDomainData` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |